<?php

use yii\db\Migration;

/**
 * Class m180813_131048_demo_houses_flats
 */
class m180813_131048_demo_houses_flats extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('house', ['id', 'name', 'section', 'address', 'n_floors', 'commission_agency', 'commission_manager', 'status'], [
            [1, 'ЖК Радостный', 'секция 1', 'ул. Фиолетовая, 132', 10, 3, 5, 10],
            [2, 'ЖК Радостный', 'секция 2', 'ул. Фиолетовая, 136', 10, 3, 5, 10],
            [3, 'ЖК Отличный', '', 'ул. Бронзовая, 34', 8, 2, 4, 10],
        ]);
        
        $this->batchInsert('flat', ['id', 'number', 'n_rooms', 'floor', 'square', 'price_m', 'price_sell_m', 'price_discount_m', 'commission_agency', 'commission_manager', 'description', 'status', 'created_at', 'updated_at', 'house_id', 'client_id'], [
            [1, '101', 2, 2, 45, 500, 450, 50, 3, 5, '', 10, 1534100000, 1534100000, 1, null],
            [2, '102', 3, 2, 60, 500, 500, 0, 3, 5, '', 8, 1534100000, 1534100000, 1, null],
            [3, '103', 1, 2, 30, 500, 450, 50, 3, 5, '', 1, 1534100000, 1534100000, 1, null],
            [4, '104', 2, 3, 48, 600, 550, 50, 3, 5, '', 10, 1534100000, 1534100000, 1, null],
            [5, '105', 3, 3, 64, 600, 600, 0, 3, 5, '', 7, 1534100000, 1534100000, 1, null],
            [6, '106', 1, 4, 33, 700, 700, 0, 3, 5, '', 1, 1534100000, 1534100000, 1, null],
            [7, '107', 2, 4, 45, 700, 600, 100, 3, 5, '', 10, 1534100000, 1534100000, 1, null],
            [8, '108', 3, 5, 62, 800, 800, 0, 3, 5, '', 2, 1534100000, 1534100000, 1, null],
            [9, '109', 1, 5, 36, 800, 800, 0, 3, 5, '', 1, 1534100000, 1534100000, 1, null],
            [10, '110', 2, 6, 45, 900, 900, 0, 3, 5, '', 10, 1534100000, 1534100000, 1, null],
            
            [11, '201', 2, 2, 45, 400, 350, 50, 3, 5, '', 10, 1534100000, 1534100000, 2, null],
            [12, '202', 3, 2, 60, 400, 400, 0, 3, 5, '', 8, 1534100000, 1534100000, 2, null],
            [13, '203', 1, 2, 30, 400, 350, 50, 3, 5, '', 10, 1534100000, 1534100000, 2, null],
            [14, '204', 2, 3, 48, 500, 450, 50, 3, 5, '', 10, 1534100000, 1534100000, 2, null],
            [15, '205', 3, 3, 64, 500, 500, 0, 3, 5, '', 7, 1534100000, 1534100000, 2, null],
            [16, '206', 1, 4, 33, 600, 600, 0, 3, 5, '', 1, 1534100000, 1534100000, 2, null],
            [17, '207', 2, 4, 45, 600, 500, 100, 3, 5, '', 10, 1534100000, 1534100000, 2, null],
            [18, '208', 3, 5, 62, 700, 700, 0, 3, 5, '', 2, 1534100000, 1534100000, 2, null],
            [19, '209', 1, 5, 36, 700, 700, 0, 3, 5, '', 10, 1534100000, 1534100000, 2, null],
            [20, '210', 2, 6, 45, 800, 800, 0, 3, 5, '', 10, 1534100000, 1534100000, 2, null],
            
            [21, '301', 2, 2, 45, 400, 400, 0, 3, 5, '', 10, 1534100000, 1534100000, 3, null],
            [22, '302', 3, 2, 60, 400, 400, 0, 3, 5, '', 8, 1534100000, 1534100000, 3, null],
            [23, '303', 1, 2, 30, 400, 400, 0, 3, 5, '', 10, 1534100000, 1534100000, 3, null],
            [24, '304', 2, 3, 48, 500, 500, 0, 3, 5, '', 10, 1534100000, 1534100000, 3, null],
            [25, '305', 3, 3, 64, 500, 500, 0, 3, 5, '', 7, 1534100000, 1534100000, 3, null],
            [26, '306', 1, 4, 33, 600, 600, 0, 3, 5, '', 1, 1534100000, 1534100000, 3, null],
            [27, '307', 2, 4, 45, 600, 600, 0, 3, 5, '', 10, 1534100000, 1534100000, 3, null],
            [28, '308', 3, 5, 62, 700, 700, 0, 3, 5, '', 2, 1534100000, 1534100000, 3, null],
            [29, '309', 1, 5, 36, 700, 700, 0, 3, 5, '', 10, 1534100000, 1534100000, 3, null],
            [30, '310', 2, 6, 45, 800, 800, 0, 3, 5, '', 10, 1534100000, 1534100000, 3, null],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $sql = "
SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;
SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='TRADITIONAL,ALLOW_INVALID_DATES';

DELETE FROM `flat`;
DELETE FROM `house`;

SET SQL_MODE=@OLD_SQL_MODE;
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;
SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;
            ";
        $this->execute($sql);
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m180813_131048_demo_houses_flats cannot be reverted.\n";

        return false;
    }
    */
}
